app/controllers/reservations_controller.rb

  def index
    @userid = current_user.id
    @restaurant = current_user.restaurants.all.pluck(:id)
    puts @restaurant
    @reservation = Reservation.find(@restaurant.to_a)
---
SELECT "restaurants"."id" FROM "restaurants" WHERE "restaurants"."user_id" = ?  [["user_id", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."restaurant_id" IN (SELECT "restaurants"."id" FROM "restaurants" WHERE "restaurants"."user_id" = ?)  [["user_id", 1]]

  def create
    @reservation = Reservation.new(reservation_params)
    puts @reservation
     if @reservation.save
---
INSERT INTO "reservations" ("lastname", "email", "date", "restaurant_id") VALUES (?, ?, ?, ?)  [["lastname", "YGAIE"], ["email", 0], ["date", "2015-03-11 00:00:00.000000"], ["restaurant_id", 4]]