app/controllers/restaurants_controller.rb

  def index
    @restaurant = current_user.restaurants.all
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."user_id" = ?  [["user_id", 1]]

  def show
   @restaurant = Restaurant.find(params[:id])
   @has_rating = Rating.where(restaurant_id: @restaurant.id, user_id: current_user.id).exists?
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 1]]
SELECT  1 AS one FROM "ratings" WHERE "ratings"."restaurant_id" = ? AND "ratings"."user_id" = ? LIMIT 1  [["restaurant_id", 1], ["user_id", 1]]
SELECT "ratings"."rating" FROM "ratings" WHERE "ratings"."restaurant_id" = ? AND "ratings"."user_id" = ?  [["restaurant_id", 2], ["user_id", 1]]

  def rate_it
    puts "RATE IT CONTROLLER"
    Rating.create(restaurant_id: params[:restaurant_id], user_id: current_user.id, rating: params[:value])
---
INSERT INTO "ratings" ("restaurant_id", "user_id", "rating") VALUES (?, ?, ?)  [["restaurant_id", 1], ["user_id", 1], ["rating", 3]]

  def unrate_it
    puts "UNNNNRATE IT CONTROLLER"
    Rating.where(user_id: current_user.id, restaurant_id: params[:restaurant_id]).destroy_all
---
DELETE FROM "ratings" WHERE "ratings"."id" = ?  [["id", 6]]
SELECT "ratings".* FROM "ratings" WHERE "ratings"."user_id" = ? AND "ratings"."restaurant_id" = ?  [["user_id", 1], ["restaurant_id", 2]]

  def create

    @restaurant = current_user.restaurants.new(restaurant_params)
     if @restaurant.save
---
INSERT INTO "restaurants" ("name", "description", "address", "phonenumber", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "asf"], ["description", "saf"], ["address", "saf"], ["phonenumber", "saf"], ["user_id", 1], ["created_at", "2015-03-15 22:58:02.886800"], ["updated_at", "2015-03-15 22:58:02.886800"]]